Repository: bbdyno/Provika
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hant

# camera.flash.accessibility.hint
source: Double-tap to toggle the camera flash.
ja: ダブルタップしてカメラのフラッシュを切り替えます。
ko: 두 번 탭하여 카메라 플래시를 전환합니다.
zh_hant: 點兩下以切換相機閃光燈。

# camera.flash.accessibility.label
source: Camera flash
ja: カメラのフラッシュ
ko: 카메라 플래시
zh_hant: 相機閃光燈

# camera.flash.accessibility.off
source: Off
ja: オフ
ko: 꺼짐
zh_hant: 關閉

# camera.flash.accessibility.on
source: On
ja: オン
ko: 켜짐
zh_hant: 開啟

# camera.recording.indicator
source: Recording
ja: 録画中
ko: 녹화 중
zh_hant: 錄影中

# gallery.datePicker.label
source: Select date
ja: 日付を選択
ko: 날짜 선택
zh_hant: 選擇日期

# gallery.detail.reported
source: Reported
ja: 報告済み
ko: 신고 완료
zh_hant: 已檢舉

# gallery.recording.accessibility.hint
source: Opens recording details and verification status.
ja: 録画の詳細と検証ステータスを開きます。
ko: 녹화 상세 정보와 검증 상태를 엽니다.
zh_hant: 開啟錄影詳細資料與驗證狀態。

# gallery.recording.accessibility.label
source: Evidence recording
ja: 証拠録画
ko: 증거 녹화
zh_hant: 證據錄影

# gallery.selection.notSelected
source: Not selected
ja: 未選択
ko: 선택 안 됨
zh_hant: 未選取

# gallery.selection.selected
source: Selected
ja: 選択済み
ko: 선택됨
zh_hant: 已選取

# settings.publicKey.copy
source: Copy public key
ja: 公開鍵をコピー
ko: 공개키 복사
zh_hant: 複製公開金鑰

# settings.publicKey.loadFailure
source: Unable to load the public key.
ja: 公開鍵を読み込めません。
ko: 공개키를 불러올 수 없습니다.
zh_hant: 無法載入公開金鑰。

# settings.signingKey.confirm.action
source: Regenerate
ja: 再生成
ko: 재생성
zh_hant: 重新產生

# settings.signingKey.confirm.message
source: Recordings signed with the existing key can no longer be verified on this device. Continue?
ja: 現在の鍵で署名された録画は、このデバイスで検証できなくなります。続けますか？
ko: 기존 키로 서명된 영상은 이 기기에서 더 이상 검증할 수 없습니다. 계속하시겠습니까?
zh_hant: 以現有金鑰簽署的錄影將無法再於此裝置上驗證。要繼續嗎？

# settings.signingKey.confirm.title
source: Regenerate signing key
ja: 署名鍵を再生成
ko: 서명 키 재생성
zh_hant: 重新產生簽署金鑰

# settings.value.days30
source: 30 days
ja: 30日
ko: 30일
zh_hant: 30 天

# settings.value.days90
source: 90 days
ja: 90日
ko: 90일
zh_hant: 90 天

# settings.value.off
source: Off
ja: オフ
ko: 끔
zh_hant: 關閉

# settings.value.seconds15
source: 15 sec
ja: 15秒
ko: 15초
zh_hant: 15 秒

# settings.value.seconds30
source: 30 sec
ja: 30秒
ko: 30초
zh_hant: 30 秒

# settings.value.seconds5
source: 5 sec
ja: 5秒
ko: 5초
zh_hant: 5 秒

# camera.permission.denied.message
source: Provika needs camera access to record evidence videos. Please enable it in Settings.
ja: 証拠映像を録画するには、Provikaにカメラへのアクセスを許可する必要があります。「設定」で有効にしてください。
ko: Provika는 증거 영상 녹화를 위해 카메라 접근이 필요합니다. 설정에서 허용해주세요.
zh_hant: Provika 需要相機存取權限才能錄製證據影片。請在「設定」中開啟權限。

# camera.permission.denied.title
source: Camera Access Required
ja: カメラへのアクセスが必要です
ko: 카메라 권한 필요
zh_hant: 需要相機存取權限

# camera.photoEvidence.accessibility.hint
source: Captures and saves still-photo evidence
ja: 静止画の証拠を撮影して保存します
ko: 사진 증거를 촬영하고 저장합니다
zh_hant: 拍攝並儲存靜態照片證據

# camera.photoEvidence.accessibility.label
source: Capture photo evidence
ja: 写真の証拠を撮影
ko: 사진 증거 촬영
zh_hant: 拍攝照片證據

# camera.photoEvidence.busy
source: Saving…
ja: 保存中…
ko: 저장 중…
zh_hant: 儲存中…

# camera.photoEvidence.failure
source: Could not save
ja: 保存できませんでした
ko: 저장하지 못함
zh_hant: 無法儲存

# camera.photoEvidence.feedback.capturing
source: Saving…
ja: 保存中…
ko: 저장 중…
zh_hant: 儲存中…

# camera.photoEvidence.feedback.failed
source: Could not save
ja: 保存できませんでした
ko: 저장하지 못함
zh_hant: 無法儲存

# camera.photoEvidence.feedback.idle
source: Photo
ja: 写真
ko: 사진
zh_hant: 照片

# camera.photoEvidence.feedback.succeeded
source: Saved
ja: 保存済み
ko: 저장됨
zh_hant: 已儲存

# camera.photoEvidence.idle
source: Photo
ja: 写真
ko: 사진
zh_hant: 照片

# camera.photoEvidence.success
source: Saved
ja: 保存済み
ko: 저장됨
zh_hant: 已儲存

# camera.preRecord.indicator
source: Pre-recording %d s
ja: プリレコード %d秒
ko: 선녹화 %d초
zh_hant: 預錄 %d 秒

# camera.record.start
source: Start Recording
ja: 録画を開始
ko: 녹화 시작
zh_hant: 開始錄影

# camera.record.stop
source: Stop Recording
ja: 録画を停止
ko: 녹화 종료
zh_hant: 停止錄影

# camera.zoom.label
source: %.1fx
ja: %.1f倍
ko: %.1f배
zh_hant: %.1f 倍

# common.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hant: 取消

# common.delete
source: Delete
ja: 削除
ko: 삭제
zh_hant: 刪除

# common.save
source: Save
ja: 保存
ko: 저장
zh_hant: 儲存

# common.select
source: Select
ja: 選択
ko: 선택
zh_hant: 選取

# common.share
source: Share
ja: 共有
ko: 공유
zh_hant: 分享

# gallery.detail.delete.confirm
source: Delete this recording? This cannot be undone.
ja: この録画を削除しますか？この操作は取り消せません。
ko: 이 영상을 삭제하시겠습니까? 되돌릴 수 없습니다.
zh_hant: 要刪除這段錄影嗎？此操作無法復原。

# gallery.detail.hash
source: Integrity Hash (SHA-256)
ja: 整合性ハッシュ（SHA-256）
ko: 무결성 해시 (SHA-256)
zh_hant: 完整性雜湊（SHA-256）

# gallery.detail.markReported
source: Mark as Reported
ja: 報告済みにする
ko: 신고 완료로 표시
zh_hant: 標示為已檢舉

# gallery.detail.signature.invalid
source: Signature Invalid ✗
ja: 署名が無効です ✗
ko: 서명 무효 ✗
zh_hant: 簽章無效 ✗

# gallery.detail.signature.valid
source: Signature Verified ✓
ja: 署名を検証済み ✓
ko: 서명 검증됨 ✓
zh_hant: 簽章已驗證 ✓

# gallery.empty.message
source: Recorded videos will appear here, organized by date.
ja: 録画した映像は日付ごとに整理され、ここに表示されます。
ko: 녹화한 영상이 날짜별로 정리되어 표시됩니다.
zh_hant: 錄製的影片會依日期整理並顯示在這裡。

# gallery.empty.title
source: No recordings yet
ja: 録画はまだありません
ko: 녹화된 영상이 없습니다
zh_hant: 尚無錄影

# gallery.title
source: Recordings
ja: 録画
ko: 녹화 영상
zh_hant: 錄影

# intent.startRecording.description
source: Launches Provika and begins a new evidence recording.
ja: Provikaを起動し、新しい証拠録画を開始します。
ko: Provika를 열고 새 증거 영상 녹화를 시작합니다.
zh_hant: 開啟 Provika 並開始新的證據錄影。

# intent.startRecording.title
source: Start Recording
ja: 録画を開始
ko: 녹화 시작
zh_hant: 開始錄影

# settings.autoDelete
source: Auto-delete
ja: 自動削除
ko: 자동 삭제
zh_hant: 自動刪除

# settings.codec
source: Codec
ja: コーデック
ko: 코덱
zh_hant: 編解碼器

# settings.overlay.device
source: Show Device Info
ja: デバイス情報を表示
ko: 기기 정보 표시
zh_hant: 顯示裝置資訊

# settings.overlay.location
source: Show GPS
ja: GPSを表示
ko: GPS 표시
zh_hant: 顯示 GPS

# settings.overlay.timestamp
source: Show Timestamp
ja: タイムスタンプを表示
ko: 시간 표시
zh_hant: 顯示時間戳記

# settings.preRecord
source: Pre-recording Buffer
ja: プリレコードバッファ
ko: 선녹화 버퍼
zh_hant: 預錄緩衝區

# settings.publicKey.show
source: View Public Key
ja: 公開鍵を表示
ko: 공개키 보기
zh_hant: 檢視公開金鑰

# settings.quality
source: Video Quality
ja: 画質
ko: 영상 품질
zh_hant: 影片畫質

# settings.section.about
source: About
ja: このアプリについて
ko: 정보
zh_hant: 關於

# settings.section.overlay
source: Overlay
ja: オーバーレイ
ko: 오버레이
zh_hant: 疊加資訊

# settings.section.recording
source: Recording
ja: 録画
ko: 녹화
zh_hant: 錄影

# settings.section.security
source: Security
ja: セキュリティ
ko: 보안
zh_hant: 安全性

# settings.section.storage
source: Storage
ja: ストレージ
ko: 저장소
zh_hant: 儲存空間

# settings.signingKey.regenerate
source: Regenerate Signing Key
ja: 署名鍵を再生成
ko: 서명 키 재생성
zh_hant: 重新產生簽署金鑰

# settings.title
source: Settings
ja: 設定
ko: 설정
zh_hant: 設定

# settings.version
source: Version
ja: バージョン
ko: 버전
zh_hant: 版本

# support.error.generic
source: Something went wrong. Please try again.
ja: 問題が発生しました。もう一度お試しください。
ko: 문제가 발생했습니다. 다시 시도해주세요.
zh_hant: 發生錯誤，請再試一次。

# support.footer
source: Provika is built and maintained by a solo developer. If this app helped you report a violation or just drive with more peace of mind, consider a one-time tip. Every coffee counts.
ja: Provikaは個人開発者が開発・運営しています。このアプリが違反の報告に役立ったり、より安心して運転する助けになったりしたなら、一度限りの応援をご検討ください。コーヒー一杯分の応援が大きな力になります。
ko: Provika는 1인 개발자가 직접 만들고 유지보수합니다. 이 앱이 위반 신고에 도움이 되었거나 운전을 조금 더 든든하게 만들어주었다면 따뜻한 응원 한 번 부탁드립니다. 커피 한 잔도 큰 힘이 됩니다.
zh_hant: Provika 由獨立開發者一人開發與維護。如果這個 App 曾協助您檢舉違規，或讓您開車時更安心，歡迎提供一次性贊助。每一杯咖啡都是莫大的支持。

# support.purchase.accessibility.hint
source: Makes a one-time tip purchase
ja: 一度限りの応援を購入します
ko: 일회성 후원을 결제합니다
zh_hant: 進行一次性贊助

# support.purchase.accessibility.pending
source: Purchase awaiting approval
ja: 購入の承認待ち
ko: 결제 승인 대기 중
zh_hant: 購買等待核准

# support.purchase.accessibility.purchasing
source: Purchase in progress
ja: 購入手続き中
ko: 결제 진행 중
zh_hant: 正在購買

# support.thanks.message
source: Your support keeps Provika independent and ad-free.
ja: ご支援により、Provikaは独立性と広告なしの運営を維持できます。
ko: 보내주신 응원 덕분에 Provika는 광고 없이, 독립적으로 이어집니다.
zh_hant: 您的支持讓 Provika 能保持獨立並維持無廣告。

# support.thanks.title
source: Thank you! ❤️
ja: ありがとうございます！❤️
ko: 감사합니다! ❤️
zh_hant: 謝謝您！❤️

# support.title
source: Support the Developer
ja: 開発者を応援
ko: 개발자 후원하기
zh_hant: 贊助開發者

# support.unavailable.message
source: Tip products could not be loaded. Check your internet connection and try again.
ja: 応援アイテムを読み込めませんでした。インターネット接続を確認して、もう一度お試しください。
ko: 네트워크 상태를 확인한 뒤 다시 시도해주세요.
zh_hant: 無法載入贊助項目。請檢查網路連線後再試一次。

# support.unavailable.title
source: Tips Unavailable
ja: 応援アイテムを利用できません
ko: 후원 상품을 불러올 수 없습니다
zh_hant: 目前無法贊助

# tab.camera
source: Camera
ja: カメラ
ko: 카메라
zh_hant: 相機

# tab.gallery
source: Gallery
ja: ギャラリー
ko: 갤러리
zh_hant: 圖庫

# tab.settings
source: Settings
ja: 設定
ko: 설정
zh_hant: 設定

# common.ok
source: OK
ko: 확인
zh_hant: 好
